Ran Plan for project: `iam/zerone-id` dir: `terraform/iam/zerone-id` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_instance_profile.jenkins will be created
+ resource "aws_iam_instance_profile" "jenkins" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "jenkins-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "app-jenkins"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.codebuild_starter will be created
+ resource "aws_iam_role" "codebuild_starter" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::066346343248:role/app-jenkins",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-starter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.jenkins will be created
+ resource "aws_iam_role" "jenkins" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "s3.amazonaws.com",
                              + "ec2.amazonaws.com",
                              + "codebuild.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-jenkins"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.codebuild_starter will be created
+ resource "aws_iam_role_policy" "codebuild_starter" {
      + id          = (known after apply)
      + name        = "codebuild-starter"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:GetLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:log-group:/aws/codebuild/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "codebuild:StartBuild",
                          + "codebuild:BatchGetBuilds",
                          + "codebuild:BatchGetProjects",
                          + "codebuild:StopBuild",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:codebuild:*:*:*",
                        ]
                    },
                ]
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_cloudwatch will be created
+ resource "aws_iam_role_policy" "jenkins_cloudwatch" {
      + id          = (known after apply)
      + name        = "jenkins-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowCloudWatchAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_ecr will be created
+ resource "aws_iam_role_policy" "jenkins_ecr" {
      + id          = (known after apply)
      + name        = "jenkins-ecr"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadECRAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ap-northeast-2:066346343248:repository/*"
                      + Sid      = "AllowReadAnotherAccountECRAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_kms will be created
+ resource "aws_iam_role_policy" "jenkins_kms" {
      + id          = (known after apply)
      + name        = "jenkins-kms-decryption"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "kms:Decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ap-northeast-2:066346343248:key/79e6d15d-a3b1-431a-a6a2-ae9c63c25ddb"
                      + Sid      = "AllowToDecryptKMSKey"
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ap-northeast-2:066346343248:parameter/*"
                      + Sid      = "AllowSsmParameterAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_operation will be created
+ resource "aws_iam_role_policy" "jenkins_operation" {
      + id          = (known after apply)
      + name        = "jenkins-operation-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                          + "ec2:TerminateInstances",
                          + "ec2:StopInstances",
                          + "ec2:RunInstances",
                          + "ec2:RequestSpotInstances",
                          + "ec2:RegisterImage",
                          + "ec2:ModifySnapshotAttribute",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:ModifyImageAttribute",
                          + "ec2:GetPasswordData",
                          + "ec2:DetachVolume",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeVpcEndpoints",
                          + "ec2:DescribeVpcEndpointServices",
                          + "ec2:DescribeVpcEndpointServicePermissions",
                          + "ec2:DescribeVpcEndpointServiceConfigurations",
                          + "ec2:DescribeVpcEndpointConnections",
                          + "ec2:DescribeVpcEndpointConnectionNotifications",
                          + "ec2:DescribeVpcClassicLinkDnsSupport",
                          + "ec2:DescribeVpcClassicLink",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSpotPriceHistory",
                          + "ec2:DescribeSpotInstanceRequests",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeRegions",
                          + "ec2:DescribePlacementGroups",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeKeyPairs",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceAttribute",
                          + "ec2:DescribeImages",
                          + "ec2:DescribeImageAttribute",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DeregisterImage",
                          + "ec2:DeleteVolume",
                          + "ec2:DeleteSnapshot",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:DeleteKeyPair",
                          + "ec2:CreateVolume",
                          + "ec2:CreateTags",
                          + "ec2:CreateSnapshot",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:CreateKeypair",
                          + "ec2:CreateImage",
                          + "ec2:CopyImage",
                          + "ec2:CancelSpotInstanceRequests",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:AttachVolume",
                          + "codebuild:*",
                          + "autoscaling:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SecurityGroupAccess"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_universal will be created
+ resource "aws_iam_role_policy" "jenkins_universal" {
      + id          = (known after apply)
      + name        = "jenkins-universal"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:DescribeTags"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAnsibleDescribeEc2TagsAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeDhcpOptions",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowVPCAccess"
                    },
                  + {
                      + Action   = "ec2:CreateNetworkInterfacePermission"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ap-northeast-2:066346343248:network-interface/*"
                      + Sid      = "AllowEC2NetworkAccess"
                    },
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                          + "ssm:UpdateInstanceInformation",
                          + "ssm:TerminateSession",
                          + "ssm:StartSession",
                          + "ssm:ResumeSession",
                          + "ssm:DescribeSessions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowSSMAccess"
                    },
                  + {
                      + Action   = [
                          + "elasticfilesystem:DescribeMountTargets",
                          + "elasticfilesystem:DescribeFileSystems",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowEFSAccess"
                    },
                  + {
                      + Action   = "s3:GetEncryptionConfiguration"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetEncryptionConfiguration"
                    },
                  + {
                      + Action   = [
                          + "ec2messages:SendReply",
                          + "ec2messages:GetMessages",
                          + "ec2messages:GetEndpoint",
                          + "ec2messages:FailMessage",
                          + "ec2messages:DeleteMessage",
                          + "ec2messages:AcknowledgeMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowEC2MessagesPermission"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ jenkins_arn                           = (known after apply)
+ jenkins_instance_profile              = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam/zerone-id`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fiam%252Fzerone-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam/zerone-id`
</details>
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
